# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLO11-OBB with HGBlock backbone and CBAM attention for oriented bounding box detection

# Parameters
nc: 1 # number of classes

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# HGBlock-based backbone (inspired by RT-DETR)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]] # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]] # 1 stage 1 - initial transformation
  - [-1, 6, HGBlock, [48, 128, 3, False, True]] # 2 stage 1 - refinement with shortcut (for P2 detection)

  - [-1, 1, DWConv, [128, 3, 2, 1, False]] # 3-P3/8
  - [-1, 6, HGBlock, [96, 256, 3]] # 4 stage 2 - initial transformation
  - [-1, 6, HGBlock, [96, 256, 3, False, True]] # 5 stage 2 - refinement with shortcut (for P3 detection)

  - [-1, 1, DWConv, [256, 3, 2, 1, False]] # 6-P4/16
  - [-1, 6, HGBlock, [128, 512, 5, True, False]] # 7 stage 3 - initial transformation
  - [-1, 6, HGBlock, [128, 512, 5, True, True]] # 8 stage 3 - refinement with shortcut
  - [-1, 6, HGBlock, [128, 512, 5, True, True]] # 9 stage 3 - additional refinement (P4 sweet spot)

  - [-1, 1, DWConv, [512, 3, 2, 1, False]] # 10-P5/32
  - [-1, 6, HGBlock, [256, 768, 5, True, False]] # 11 stage 4 - initial transformation
  - [-1, 6, HGBlock, [256, 768, 5, True, True]] # 12 stage 4 - refinement with shortcut

  - [-1, 1, DWConv, [768, 3, 2, 1, False]] # 13-P6/64
  - [-1, 6, HGBlock, [384, 1024, 5, True, False]] # 14 stage 5 - initial transformation
  - [-1, 6, HGBlock, [384, 1024, 5, True, True]] # 15 stage 5 - refinement with shortcut

  - [-1, 1, SPPF, [1024, 5]] # 16
  - [-1, 2, C2PSA, [1024]] # 17

# YOLO11-OBB head with multi-scale detection and CBAM attention
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 11], 1, Concat, [1]] # cat backbone P5
  - [-1, 3, C2, [768, False]] # 20

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 23

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 26

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 29 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 26], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 32 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 23], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 35 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 20], 1, Concat, [1]] # cat head P5
  - [-1, 2, C3k2, [768, True]] # 38 (P5/32-large)

  - [-1, 1, Conv, [768, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P6
  - [-1, 2, C3k2, [1024, True]] # 41 (P6/64-xlarge)

  # OBB Detection head WITH CBAM attention
  # Format: [input_layers, repeats, module, [nc, ne, use_cbam, cbam_kernel]]
  # Args: nc (classes), ne (extra params), use_cbam (bool), cbam_kernel (optional)
  # Note: 'ch' (channels) is automatically added by the parser from the 'from' layers
  #
  # use_cbam=True enables CBAM attention in classification head
  # cbam_kernel options:
  #   - None: Auto-adaptive (P2/P3→7×7, P4+→3×3) - RECOMMENDED
  #   - int (3 or 7): Fixed kernel for all layers
  #   - list [7,7,3,3,3]: Per-layer kernels (must match number of detection layers)
  - [[29, 32, 35, 38, 41], 1, OBB, [nc, 1, True]] # OBB Detect with CBAM auto-adaptive kernels
